<?php

namespace PoolPort\PayPing;

use PoolPort\Exceptions\PoolPortException;

class PayPingException extends PoolPortException
{
    public static $errors = array(
        '1' => 'تراكنش توسط شما لغو شد',
        '2' => 'رمز کارت اشتباه است.',
        '3' => 'cvv2 یا تاریخ انقضای کارت وارد نشده است',
        '4' => 'موجودی کارت کافی نیست.',
        '5' => 'تاریخ انقضای کارت گذشته است و یا اشتباه وارد شده.',
        '6' => 'کارت شما مسدود شده است',
        '7' => 'تراکنش مورد نظر توسط درگاه یافت نشد',
        '8' => 'بانک صادر کننده کارت شما مجوز انجام تراکنش را صادر نکرده است',
        '9' => 'مبلغ تراکنش مشکل دارد',
        '10' => 'شماره کارت اشتباه است.',
        '11' => 'ارتباط با درگاه برقرار نشد، مجددا تلاش کنید',
        '12' => 'خطای داخلی بانک رخ داده است',
        '15' => 'این تراکنش قبلا تایید شده است',
        '18' => 'کاربر پذیرنده تایید نشده است',
        '19' => 'هویت پذیرنده کامل نشده است و نمی تواند در مجموع بیشتر از ۵۰ هزار تومان دریافتی داشته باشد',
        '25' => 'سرویس موقتا از دسترس خارج است، لطفا بعدا مجددا تلاش نمایید',
        '26' => 'کد پرداخت پیدا نشد',
        '27' => 'پذیرنده مجاز به تراکنش با این مبلغ نمی باشد',
        '28' => 'لطفا از قطع بودن فیلتر شکن خود مطمئن شوید',
        '29' => 'ارتباط با درگاه برقرار نشد',
        '31' => 'امکان تایید پرداخت قبل از ورود به درگاه بانک وجود ندارد',
        '38' => 'آدرس سایت پذیرنده نا معتبر است',
        '39' => 'پرداخت ناموفق، مبلغ به حساب پرداخت کننده برگشت داده خواهد شد',
        '44' => 'RefId نامعتبر است',
        '46' => 'توکن ساخت پرداخت با توکن تایید پرداخت مغایرت دارد',
        '47' => 'مبلغ تراکنش مغایرت دارد',
        '48' => 'پرداخت از سمت شاپرک تایید نهایی نشده است',
        '49' => 'پرداخت از سمت شاپرک تایید نهایی نشده است',
    );

    public function __construct($action, $code = null)
    {
        parent::__construct(self::getError($action), $code);
    }

    public static function getError($action)
    {
        if (isset(self::$errors[$action])) {
            return $action." ".self::$errors[$action];
        } else {
            return $action;
        }
    }
}
