<?php

namespace PoolPort\Saman;

class SamanException extends \Exception
{
    public static $errors = array(
        -1 => 'خطا در پردازش اطلاعات ارسالی (مشکل در یکی از ورودی ها و ناموفق بودن فراخوانی متد برگشت تراکنش)',
        -3 => 'ورودیها حاوی کارکترهای غیرمجاز میباشند.',
        -4 => 'کلمه عبور یا کد فروشنده اشتباه است (Merchant Authentication Failed)',
        -6 => 'تراکنش قبلا برگشت داده شده است.',
        -7 => 'رسید دیجیتالی تهی است.',
        -8 => 'طول ورودیها بیشتر از حد مجاز است.',
        -9 => 'وجود کارکترهای غیرمجاز در مبلغ برگشتی.',
        -10 => 'رسید دیجیتالی به صورت Base64 نیست (حاوی کاراکترهای غیرمجاز است)',
        -11 => 'طول ورودیها ک تر از حد مجاز است.',
        -12 => 'مبلغ برگشتی منفی است.',
        -13 => 'مبلغ برگشتی برای برگشت جزئی بیش از مبلغ برگشت نخوردهی رسید دیجیتالی است.',
        -14 => 'چنین تراکنشی تعریف نشده است.',
        -15 => 'مبلغ برگشتی به صورت اعشاری داده شده است.',
        -16 => 'خطای داخلی سیستم',
        -17 => 'برگشت زدن جزیی تراکنش مجاز نمی باشد.',
        -18 => 'IP Address فروشنده نا معتبر است',
    );
}
