<?php

namespace PoolPort\Saman;

class SamanException extends \Exception
{
    public static $errors = array(
        -1 => 'خطا در پردازش اطلاعات ارسالی (مشکل در یکی از ورودی ها و ناموفق بودن فراخوانی متد برگشت تراکنش)',
        -3 => 'ورودیها حاوی کارکترهای غیرمجاز میباشند.',
        -4 => 'کلمه عبور یا کد فروشنده اشتباه است (Merchant Authentication Failed)',
        -6 => 'سند قبال برگشت کامل یافته است. یا خارج از زمان 30 دقیقه ارسال شده است.',
        -7 => 'رسید دیجیتالی تهی است.',
        -8 => 'طول ورودیها بیشتر از حد مجاز است.',
        -9 => 'وجود کارکترهای غیرمجاز در مبلغ برگشتی.',
        -10 => 'رسید دیجیتالی به صورت Base64 نیست (حاوی کاراکترهای غیرمجاز است)',
        -11 => 'طول ورودیها ک تر از حد مجاز است.',
        -12 => 'مبلغ برگشتی منفی است.',
        -13 => 'مبلغ برگشتی برای برگشت جزئی بیش از مبلغ برگشت نخوردهی رسید دیجیتالی است.',
        -14 => 'چنین تراکنشی تعریف نشده است.',
        -15 => 'مبلغ برگشتی به صورت اعشاری داده شده است.',
        -16 => 'خطای داخلی سیستم',
        -17 => 'برگشت زدن جزیی تراکنش مجاز نمی باشد.',
        -18 => 'IP Address فروشنده نا معتبر است و یا رمز تابع بازگشتی (reverseTransaction) اشتباه است.',
    );

    public static $stateErrors = array(
        -1 => ' تراکنش توسط خریدار کنسل شده است.',
        79 => 'مبلغ سند برگشتی، از مبلغ تراکنش اصلی بیشتر است.',
        12 => 'درخواست برگشت یک تراکنش رسیده است، در حالی که تراکنش اصلی پیدا نمی شود.',
        14 => 'شماره کارت نامعتبر است.',
        15 => 'چنین صادر کننده کارتی وجود ندارد.',
        33 => 'از تاریخ انقضای کارت گذشته است و کارت دیگر معتبر نیست.',
        38 => 'رمز کارت 3 مرتبه اشتباه وارد شده است در نتیجه کارت غیر فعال خواهد شد.',
        55 => 'خریدار رمز کارت را اشتباه وارد کرده است.',
        61 => 'مبلغ بیش از سقف برداشت می باشد.',
        93 => 'تراکنش Authorize شده است (شماره PIN و PAN درست هستند) ولی امکان سند خوردن وجود ندارد.',
        68 => 'تراکنش در شبکه بانکی Timeout خورده است.',
        34 => 'خریدار یا فیلد CVV2 و یا فیلد ExpDate را اشتباه وارد کرده است (یا اصال وارد نکرده است).',
        51 => 'موجودی حساب خریدار، کافی نیست.',
        84 => 'سیستم بانک صادر کننده کارت خریدار، در وضعیت عملیاتی نیست.',
        96 => 'کلیه خطاهای دیگر بانکی باعث ایجاد چنین خطایی می گردد.',
    );

    public static function error($errorId = null)
    {
        if (is_null($errorId)) {
            return new SamanException;
        }
        $errorId = intval($errorId);

        return new SamanException(@self::$errors[$errorId].' #'.$errorId, $errorId);
    }

    public static function stateError($errorId = null)
    {
        if (is_null($errorId)) {
            return new SamanException;
        }
        $errorId = intval($errorId);

        return new SamanException(@self::$stateErrors[$errorId].' #'.$errorId, $errorId);
    }
}
